{
  "Home": {
    "greeting": "Hi, I'm Catalina.",
    "title": "Front End Developer",
    "description": "I used to think frontend was about making things look good. Then I learned it's about making things feel right. Now, I craft  interfaces that listen and adapt to users, stories that stick, and code that welcomes everyone in.",
    "getInTouch": "Get in touch",
    "downloadCV": "Download CV",
    "viewCV": "View My CV",
    "interactiveCV": "Interactive CV",
    "interactiveCVDesc": "Explore my journey online",
    "downloadPDF": "Download PDF",
    "downloadPDFDesc": "Traditional format"
  },
  "Navigation": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "skills": "Skills",
    "experience": "Experience",
    "contact": "Contact"
  },
  "Divider": {
    "exploreMyStory": "EXPLORE MY STORY",
    "readMoreAboutMe": "READ MORE ABOUT ME"
  },
  "About": {
    "title": "About me",
    "description": "Let me take you through my journey of transformation — from navigating the seas to navigating the web.",
    "text": "While my journey may have started on cruise ships, today I'm embarking on new adventures in web development — where each project is an opportunity to create something meaningful and impactful."
  },
  "Journey": {
    "cards": [
      {
        "title": "The Journey Begins",
        "content": "Life often takes us on unexpected journeys. My path from being a casino dealer and supervisor on cruise ships to becoming a Front-End developer was anything but conventional."
      },
      {
        "title": "The Transition",
        "content": "Driven by a deep-seated curiosity for technology and a desire for change, I enrolled in an Android development course. This first step into mobile app development opened my eyes to the possibilities in tech."
      },
      {
        "title": "The Discovery",
        "content": "While Android development was fulfilling, I found my true passion in Front-End development. Learning HTML, CSS, and JavaScript revealed a perfect blend of creativity and technical challenge."
      },
      {
        "title": "Present Course",
        "content": "Today, I'm crafting digital experiences where creativity meets code. Each project is an opportunity to combine my people skills from hospitality with technical expertise."
      }
    ]
  },
  "Projects": {
    "title": "Projects",
    "DigitalTravelJournal": {
      "heading": "Digital Travel Journal",
      "subheading": "An interactive app for travel enthusiasts that combines map, API integrations, and customizable postcards. Awarded 'Best Final Project' at Medieinstitutet for its technical innovation and WCAG accessibility standards implementation.",
      "liveUrl": "https://your-travel-journal-url.com",
      "githubUrl": "https://github.com/CatAvadani/digital-travel-journal"
    },
    "Ako & Co": {
      "heading": "Ako & Co",
      "subheading": "A modern e-commerce website for a fictional fashion brand. The app includes product browsing, advanced filtering, cart functionality, authentication with NextAuth, and integrated PayPal and Stripe payments. Built with a full-stack setup using PostgreSQL and Prisma, and includes admin tools for order management, user profiles, and automated email receipts via Resend.",
      "liveUrl": "https://your-ako-co-url.com",
      "githubUrl": "https://github.com/CatAvadani/ako-co"
    },
    "NexerEmail": {
      "heading": "Nexer Email",
      "subheading": "A professional project developed at Nexer Group for creating and managing responsive email campaigns. Built a complex system from scratch focusing on cross-client compatibility and accessibility.",
      "modalDescription": "The Email Builder is a web-based tool that allows marketing teams to create responsive email campaigns. I contributed to developing this complex system from scratch with a focus on ensuring emails render correctly across different clients while maintaining accessibility standards.",
      "highlights": [
        "Implemented preview system for visualizing email designs across different clients including Gmail and Outlook",
        "Engineered solutions for compatibility issues in email rendering to ensure consistent appearance",
        "Developed test-driven approach with Cypress for ensuring stability and preventing regressions",
        "Created accessible components according to WCAG standards for inclusive user experience"
      ]
    },
    "BoostApp": {
      "heading": "Boost App",
      "subheading": "Contributed to a fitness tracking platform at Nexer Group by implementing a complete UI redesign and enhancing functionality. Transformed the user experience through modern design principles while ensuring cross-platform compatibility.",
      "modalDescription": "Boost App is a cross-platform fitness tracking application designed to promote health and activity among employees. I worked on redesigning key aspects of the user interface to improve usability and visual appeal, while ensuring seamless functionality across both mobile and web platforms.",
      "highlights": [
        "Redesigned and implemented the competition section UI in the admin interface according to new Figma specifications",
        "Created new responsive layouts and interactive components that improved user engagement",
        "Resolved cross-platform synchronization issues between mobile app and web admin dashboard",
        "Implemented UI components with a focus on accessibility and visual consistency"
      ]
    },
    "TVMaze": {
      "heading": "TV MaZe",
      "subheading": "A mobile application developed with React Native that allows users to search for TV shows, view detailed information, and manage favorites. Focuses on performance and user experience in a mobile context.",
      "liveUrl": "https://your-tvmaze-url.com",
      "githubUrl": "https://github.com/CatAvadani/tv-maze"
    },
    "modal": {
      "title": "Frontend Developer Internship",
      "projectOverview": "Project Overview",
      "technologies": "Technologies",
      "myContribution": "My Contribution",
      "close": "Close",
      "confidentialNotice": "This project was completed during my internship at Nexer Group. Due to confidentiality agreements, source code and detailed screenshots cannot be shared publicly. I'm happy to discuss the technical details further in an interview setting."
    }
  },
  "Skills": {
    "title": "My Skills"
  },
  "Experience": {
    "title": "My Experience",
    "entries": [
      {
        "title": "Frontend Developer - Internship",
        "location": "Nexer Group, Gothenburg",
        "description": "At Nexer, I contributed to two key projects: Nexer Email, an email builder platform and Boost App, a cross-platform fitness tracker. I built accessible and responsive UIs using Next.js, React Native, Angular, TypeScript, Zustand, and Tailwind CSS. My work included implementing dynamic layouts, syncing data across frontend and backend, optimizing loading performance, and enhancing user experience. I also developed features for sending and previewing test emails with Nodemailer, built logic for layout restrictions, and wrote Cypress end-to-end tests to ensure stability. Throughout, I collaborated in an agile team and worked actively with Git and Azure DevOps.",
        "date": "Sept 2024 - April 2025"
      },
      {
        "title": "Android Developer - Internship",
        "location": "Stendahls, Gothenburg",
        "description": "Designed and implemented Android app features using Kotlin, Jetpack Compose, and built data management solutions using Room Database. Followed MVVM architecture and implemented API integrations to connect mobile clients with backend services. Collaborated in an agile environment, participated in code reviews and optimized application performance through efficient memory management.",
        "date": "Oct 2022 - Dec 2022"
      },
      {
        "title": "Operations & Customer Relations Specialist",
        "location": "Casino Cosmopol, Gothenburg",
        "description": "Led high-stakes casino operations in a fast-paced environment, handling financial transactions and customer disputes with accuracy and discretion. Developed a keen eye for detail and problem-solving by identifying fraudulent activities and preventing financial losses.",
        "date": "Oct 2018 -June 2024"
      }
    ]
  },
  "Contact": {
    "title": "Contact Me",
    "paragraph1": "Feel free to reach out via email at",
    "paragraph2": "or send a message using the form below.",
    "placeholderEmail": "john@example.com",
    "placeholderMessage": "Tell me about your project...",
    "success": "Email sent successfully!",
    "submit": "Send Message"
  },
  "CV": {
    "title": "Interactive CV",
    "subtitle": "A comprehensive overview of my journey as a frontend developer",
    "jobTitle": "Frontend Developer | React, Next.js, TypeScript, PostgreSQL",
    "backToPortfolio": "Back to Portfolio",
    "downloadPDF": "Download PDF",
    "getInTouch": "Get in Touch",
    "viewPortfolio": "View Portfolio",
    "interestedText": "Interested in working together?",
    "whatIBring": "What I Bring:",
    "languagesTitle": "Languages",
    "sections": {
      "about": {
        "title": "About Me",
        "content": "As a full stack developer, I combine technical expertise with business understanding to create digital solutions that make a real difference. With a strong foundation in React, Next.js, TypeScript, and PostgreSQL, I have successfully delivered everything from email marketing platforms to e-commerce solutions.\n\nMy journey from customer service to technical development has given me valuable insight into how technology impacts end users. I'm passionate about building solutions that not only work technically, but genuinely improve people's daily lives."
      },
      "experience": {
        "title": "Work Experience"
      },
      "projects": {
        "title": "Featured Projects"
      },
      "skills": {
        "title": "Technical Skills"
      },
      "education": {
        "title": "Education"
      },
      "languages": {
        "title": "Languages"
      }
    },
    "highlights": [
      {
        "title": "Technical Versatility",
        "desc": "Experienced in both frontend and backend development, with hands-on experience in Azure environments, databases, and modern JavaScript frameworks"
      },
      {
        "title": "Problem-Solving Mindset",
        "desc": "Proven ability to solve complex compatibility issues and optimize user experiences"
      },
      {
        "title": "Quality Focus",
        "desc": "Strong commitment to WCAG standards, code reviews, and best practices for accessible web development"
      },
      {
        "title": "Business Understanding",
        "desc": "Unique background in customer relations provides valuable insight into user needs and business-critical systems"
      }
    ],
    "languages": [
      {
        "language": "English",
        "level": "Fluent"
      },
      {
        "language": "Swedish",
        "level": "Good Knowledge"
      }
    ],
    "experiences": [
      {
        "title": "Frontend Developer",
        "company": "Nexer Group AB, Gothenburg",
        "date": "Sept 2024 - April 2025",
        "description": "Developed and improved functionality in email marketing platforms and health apps using React, Next.js, TypeScript, and Angular. Worked with Azure environments, implemented real-time synchronization, and solved complex email compatibility issues across different clients.",
        "isInternship": true,
        "skills": [
          "React",
          "Next.js",
          "TypeScript",
          "Angular",
          "Azure",
          "Cosmos DB"
        ]
      },
      {
        "title": "Android Developer",
        "company": "Stendahls, Gothenburg",
        "date": "Oct 2022 - Dec 2022",
        "description": "Quickly assimilated the fundamentals of Android development using Jetpack Compose, Room Database, and Kotlin, effectively applying these skills to create functional application components within a short timeframe.",
        "isInternship": true,
        "skills": ["Android", "Kotlin", "Jetpack Compose", "Room Database"]
      },
      {
        "title": "Operations & Customer Relations Specialist",
        "company": "Casino Cosmopol, Gothenburg",
        "date": "Oct 2018 - June 2024",
        "description": "Led high-stakes casino operations in a fast-paced environment, handling financial transactions and customer disputes with accuracy and discretion. Developed marketing strategies and collaborated with security teams.",
        "isInternship": false,
        "skills": [
          "Customer Relations",
          "Operations",
          "Problem Solving",
          "Team Collaboration"
        ]
      }
    ],
    "projects": [
      {
        "title": "Digital Travel Journal",
        "description": "Interactive web app for travel enthusiasts with map integrations and customizable postcards. Awarded 'Best Final Project' at Medieinstitutet.",
        "technologies": [
          "Next.js",
          "TypeScript",
          "Firebase",
          "Mapbox API",
          "WCAG 2.1"
        ],
        "liveUrl": "https://your-travel-journal-url.com",
        "githubUrl": "https://github.com/CatAvadani/digital-travel-journal",
        "isNexerProject": false
      },
      {
        "title": "Ako&Co E-commerce",
        "description": "Modern e-commerce platform with authentication, shopping cart, payment integration, and admin dashboard.",
        "technologies": [
          "Next.js 15",
          "React 19",
          "PostgreSQL",
          "Prisma",
          "Stripe",
          "PayPal"
        ],
        "liveUrl": "https://your-ako-co-url.com",
        "githubUrl": "https://github.com/CatAvadani/ako-co",
        "isNexerProject": false
      },
      {
        "title": "Nexer Email Platform",
        "description": "Professional email builder platform focusing on cross-client compatibility and accessibility.",
        "technologies": ["Next.js", "TypeScript", "Azure", "Cypress"],
        "isNexerProject": true
      }
    ],
    "skills": [
      "React",
      "HTML",
      "Next.js",
      "CSS/SCSS",
      "TypeScript",
      "Tailwind CSS",
      "JavaScript",
      "Framer Motion",
      "React Native",
      "Figma",
      "PostgreSQL",
      "UX & Accessibility",
      "MongoDB",
      "WCAG",
      "Git/GitHub",
      "Azure DevOps"
    ],
    "education": [
      {
        "title": "Frontend Developer | YH",
        "school": "Medieinstitutet, Gothenburg",
        "date": "08-2023 - 04-2025"
      },
      {
        "title": "UX & Accessibility | YH",
        "school": "Medieinstitutet, Gothenburg",
        "date": "03-2025 - 05-2025"
      }
    ],
    "contact": {
      "email": "catalinaavadani@gmail.com",
      "phone": "+46 076 096 8621",
      "location": "Gothenburg, Sweden"
    },
    "nexerModal": {
      "title": "Nexer Email Platform",
      "description": "A professional email marketing platform developed at Nexer Group, focusing on creating and managing responsive email campaigns with cross-client compatibility.",
      "keyFeatures": "Key Features:",
      "features": [
        "Cross-client email template compatibility (Gmail, Outlook, etc.)",
        "Real-time email preview and testing",
        "Responsive design optimization",
        "Accessibility compliance (WCAG standards)",
        "Integration with backend services via Azure"
      ]
    }
  }
}
